{
  "experiences": [
    {
      "title": "Data Science Intern",
      "organization": "MultiPlan Corporation",
      "organizationLink": "https://www.multiplan.us/",
      "date": "Jun 2024 - Present",
      "points": [
        "Delivered a high-impact predictive model, by leveraging a custom loss function based on ordered probability, to improve appeal forecasting and negotiation, generating additional 12% savings for the clients translating to $8,780,000",
        "Developed a framework for feasible big data model training on neural networks and gradient boosting algorithms, optimizing GPU-based matrix computations, resulting in a 150X speedup reducing training time from 50 mins to 2 secs.",
        "Automated API workflows, streamlining data collection and processing for 9,000,000 claims saving the team 40 hours of work per month by eliminating manual data retrieval tasks and enhancing training data for modelling."
      ],
      "skills": [ "AI/ML", "PyTorch", "Oracle", "LightGBM", "CUDA" ]
    },
    {
      "title": "Teaching Assistant",
      "organization": "MSU",
      "organizationLink": "https://msu.edu/",
      "date": "Aug 2022 - May 2024",
      "points": [
        "Courses: Computer Vision, Computer Networks, Matrix Algebra with Computational Applications.",
        "Guided academic success of students by conducting one-on-one mentorship sessions and collaborated with professors and TAs to enhance the course experience."
      ],
      "skills": [ "Computer Vision", "PyTorch", "OS" ]
    },
    {
      "title": "MSU Capstone Software Developer",
      "organization": "Vectorform",
      "organizationLink": "https://www.vectorform.com/",
      "date": "Jan 2023 - May 2023",
      "points": [
        "Developed a Unity-based VR application that provides an innovative virtual training space for AI-enhanced training.",
        "Fine-tuned GPT-3 Davinci via Python on 300 conversations and optimized token utilization for context-driven responses, resulting in savings of 1000 tokens per conversation and a 4-second improvement in response times.",
        "Engineered a web application for training replay utilizing Angular, Node.js, and Azure SQL and blob storage.",
        "Integrated an embedded interactable WebGL build of a free-cam training replay system."
      ],
      "skills": [ "Unity", "WebGL", "Angular", "Node.js", "Azure", "Prompt Engineering" ]
    },
    {
      "title": "Software Developer Intern",
      "organization": "Roosevelt Innovations",
      "organizationLink": "https://rooseveltinnovations.com/",
      "date": "May 2022 - Aug 2022",
      "points": [
        "Implemented an enterprise-level feature (using MEAN stack REST, JSON, Kafka, and containerization) that leverages client-specific information and quotes to accurately recommend insurance packages.",
        "Collaborated closely with underwriting and claims analysis experts to gain insights into claims handling processes.",
        "Utilized concepts of Machine Learning, AI, NLP, word embeddings, and Word2Vec to generate 94% of existing business insurance rules with 99% precision."
      ],
      "skills": [ "Angular", "Node.js", "REST", "JSON", "AI/ML", "NLP", "MongoDB" ]
    }
  ]

}